Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The colour to set the region.
zh_cn: 设置区域的颜色。

source: The colour to set, either an integer, a constant, or a hex value.
zh_cn: 要设置的颜色，可以是整数、常量或十六进制值。

source: The colour to use (either a constant, a real or a hex value).
zh_cn: 使用的颜色(常量、实数或十六进制值)。

source: The colour to use for the light (either a constant, a real or a hex value).
zh_cn: 用于灯光的颜色(常量、实数或十六进制值)。

source: The colour to use.
zh_cn: 要使用的颜色。

source: The colour value to use (A constant, integer or hex value).
zh_cn: 要使用的颜色值(常量、整数或十六进制值)。

source: The colour with which the screen will be cleared
zh_cn: 清除屏幕的颜色

source: The colour with which to blend the bottom left area of the sprite.
zh_cn: 精灵左下方区域的混合颜色。

source: The colour with which to blend the bottom right area of the sprite.
zh_cn: 精灵右下方区域的混合颜色。

source: The colour with which to blend the sprite.
zh_cn: 精灵的混合颜色。

source: The colour with which to blend the surface.
zh_cn: 与表面混合的颜色。

source: The colour with which to blend the top left area of the sprite.
zh_cn: 精灵左上方区域的混合颜色。

source: The colour with which to blend the top right area of the sprite.
zh_cn: 精灵右上方区域的混合颜色。

source: The colour with which to colour the surface.
zh_cn: 用于着色表面的颜色。

source: The column to use for sorting the rows
zh_cn: 用于对行进行排序的列

source: The comparison mode to use (see list above)
zh_cn: 要使用的比较模式(参见上面的列表)

source: The config constant to set (refer to the table at the top of this page).
zh_cn: 要设置的配置常量(请参阅本页顶部的表格)。

source: The connection uses a special protocol that ensures only GameMaker games connect to each other, however if you need to connect to a server that is not a GameMaker game, you can use network_connect_async_raw().
zh_cn: 该连接使用一个特殊的协议，以确保只有GameMaker游戏彼此连接，但如果你需要连接到一个非GameMaker游戏的服务器，你可以使用network_connect_async_raw()。

source: The connection uses a special protocol that ensures only GameMaker games connect to each other, however if you need to connect to a server that is not a GameMaker game, you can use network_connect_raw().
zh_cn: 该连接使用一种特殊的协议，确保只有GameMaker游戏才能相互连接，但是如果您需要连接到一个不是GameMaker游戏的服务器，您可以使用network_connect_raw()。

source: The constant for the joint property that you wish to change
zh_cn: 你想要改变的关节属性的常量

source: The constant for the joint property that you wish to test
zh_cn: 你想要测试的关节性质的常量

source: The constant used to set the falloff model.
zh_cn: 用于设置衰减模型的常量。

source: The constructor reference to check against
zh_cn: 要检查的构造函数引用

source: The content of the message (maximum of 128 bytes allowed).
zh_cn: 消息的内容(最多允许128个字节)。

source: The contents of this struct are detailed on this page.
zh_cn: 这个结构的内容在此页面上有详细说明。

source: The created GIF will be palletized using the Universal 884 Palette (see here for more information).
zh_cn: 创建的GIF将使用通用884调色板进行托盘化(更多信息请参见此处)。

source: The created sprite font will then have the sub-images set to an individual glyph from the font, where the "first" glyph will have the image_index of 0.
zh_cn: 然后，所创建的sprite字体将子图像设置为该字体的单个字形，其中"第一"字形的image_index为0。

source: The cross origin type to use (a string)
zh_cn: 要使用的跨域类型类型(字符串)

source: The cull mode to use (see list above)
zh_cn: 要使用的筛选模式(参见上面的列表)

source: The current joint movement speed.
zh_cn: 当前关节运动速度。

source: The current motor force
zh_cn: 当前马达力

source: The current motor speed
zh_cn: 当前马达速度

source: The current motor torque
zh_cn: 当前马达扭矩

source: The current projection matrix
zh_cn: 当前投影矩阵

source: The current view matrix
zh_cn: 当前视图矩阵

source: The current world matrix
zh_cn: 当前世界矩阵

source: The cursor to set for the game window.
zh_cn: 为游戏窗口设置的光标。

source: The custom debug event string to use.
zh_cn: 要使用的自定义调试事件字符串。

source: The custom debug message to show or a string format.
zh_cn: 要显示的自定义调试消息或字符串格式。

source: The custom debug message to show.
zh_cn: 要显示的自定义调试消息。

source: The damping is the amount of "resistance" to angular rotation that the physics enabled instance has, with a lower value permitting the instance to rotate faster after a collision (for example) and a higher value making it require a more forceful push and rotate slower
zh_cn: 阻尼是物理启用实例的角度旋转"阻力"的数量，较低的值允许实例在碰撞后旋转得更快(例如)，较高的值使它需要更有力的推动和更慢的旋转

source: The damping is the amount of "resistance" to forward movement that the physics enabled instance has, with a lower value permitting the instance to move and accelerate faster and a higher value making it require a more forceful push
zh_cn: 阻尼是物理启用实例向前移动的"阻力"量，较低的值允许实例更快地移动和加速，较高的值使其需要更有力的推动

source: The damping ratio is non-dimensional and defines the "springiness" of the joint.
zh_cn: 阻尼比是无量纲的，定义了关节的"弹性"。

source: The data offset to start copying from (in bytes).
zh_cn: 开始复制的数据偏移量(以字节为单位)。

source: The data offset value (in bytes).
zh_cn: 数据偏移值(以字节为单位)。

source: The data offset value.
zh_cn: 数据偏移值。

source: The data package to send to your game (a string)
zh_cn: 要发送到游戏的数据包(字符串)

source: The data sent is not formatted by GameMaker in any way and the receiving devices will get the data as a stream which means you will have to handle it yourself.
zh_cn: 发送的数据没有被GameMaker以任何方式格式化，接收设备将以流的形式获取数据，这意味着你必须自己处理它。

source: The data string to be uploaded.
zh_cn: 要上传的数据字符串。

source: The data to add to the buffer, in accordance with the type specified.
zh_cn: 根据指定的类型，要添加到缓冲区的数据。

source: The data to be transmitted following the headers (can be a binary buffer handle)
zh_cn: 在头文件后面传输的数据(可以是二进制缓冲区句柄)

source: The data to write.
zh_cn: 要写入的数据。

source: The data type that this custom vertex data will hold (see the type constants listed below).
zh_cn: 该自定义顶点数据将包含的数据类型(请参见下面列出的类型常量)。

source: The data you fill the buffer with must be in agreement with the "type" argument of this function, meaning that you can't try to fill with a string and use the unsigned 16bit integer type, for example.
zh_cn: 你用来填充缓冲区的数据必须与此函数的"类型"参数一致，这意味着你不能试图用一个字符串来填充并使用无符号的16位整数类型。

source: The data you write must be in agreement with the "type" argument of this function, meaning that you can't try to write a string as an unsigned 16bit integer, for example.
zh_cn: 写入的数据必须与此函数的"type"参数一致，这意味着不能尝试将字符串写成无符号的16位整数。

source: The date to check.
zh_cn: 要检查的日期。

source: The date to compare it to.
zh_cn: 与之比较的日期。

source: The date to use.
zh_cn: 要使用的日期。

source: The date/time to fire the off the notification
zh_cn: 取消通知的日期/时间

source: The datetime to add to
zh_cn: 要添加的日期时间

source: The datetime to add to.
zh_cn: 要添加的日期时间。

source: The datetime to check.
zh_cn: 要检查的日期时间。

source: The datetime to compare it to.
zh_cn: 要与之比较的日期时间。

source: The datetime to compare the first one to.
zh_cn: 与第一个日期时间进行比较的日期时间。

source: The datetime to extract the date from.
zh_cn: 从中提取日期的日期时间。

source: The datetime to extract the time from.
zh_cn: 要从中提取时间的datetime。

source: The datetime to use.
zh_cn: 要使用的日期时间。

source: The day to check.
zh_cn: 要检查的日子。

source: The day to set.
zh_cn: 要设定的日期。

source: The dead zone value from 0 to 1.
zh_cn: 死区值从0到1。

source: The debug overlay shows a graphic CPU/GPU usage bar in the actual game window itself along with the current real fps value, number of texture swaps and the number of vertex batches (note that texture swaps and vertex batches will never be zero and will normally show values of 2 or 3, since even with an empty room an no objects GameMaker still has to draw and batch things).
zh_cn: 调试覆盖图在实际的游戏窗口中显示了一个图形CPU/GPU使用情况栏，以及当前的实际fps值、纹理交换的数量和顶点批次的数量(注意，纹理交换和顶点批次永远不会为零，通常会显示值2或3，因为即使是在一个空的房间中，没有对象的GameMaker仍然必须绘制和批处理东西)。

source: The default a precision of 0.0000001 is used for all data structure functions unless changed by this function.
zh_cn: 默认精度为0.0000001，用于所有数据结构函数，除非由此函数更改。

source: The default colour is c_black.
zh_cn: 默认颜色是c_black。

source: The default format is no extra spaces on the left, and only two decimal places on the right, eg "265.73".
zh_cn: 默认的格式是左边没有多余的空格，右边只有两位小数，比如"265.73"。

source: The default listener index is 0, but you can use the function audio_get_listener_info() to get the different indices available for the target platform.
zh_cn: 默认的侦听器索引是0，但是您可以使用函数audio_get_listener_info()来获取目标平台可用的不同索引。

source: The default listener position is (0, 0, 0) so this means that if the listener has not been moved and you want the sound to come from the left (for example), you should set the x position to a negative value (for more information on setting the listener position see audio_listener_position()).
zh_cn: 默认的位置是(0,0,0)，因此这意味着如果没有被移动，而您希望声音从左侧传来(例如)，则应该将x位置设置为负值(有关设置位置的更多信息，请参阅audio_listener_position()))。

source: The default number for the physics system is 10, but this can be changed to higher or lower depending how many times you want the physics to calculate each step, but it is recommended that you set this no lower than 5 and no higher than 30.
zh_cn: 物理系统的默认数值是10，但是可以根据您希望物理计算每一步的次数将其更改为更高或更低，但是建议您将其设置为不低于5且不高于30。

source: The default password
zh_cn: 默认密码

source: The default properties for a soft body particle.
zh_cn: 柔体粒子的默认属性。

source: The default string in the text box.
zh_cn: 文本框中的默认字符串。

source: The default string.
zh_cn: 默认字符串。

source: The default system uses an old > new look (the function is set to true), where old particles are drawn at a higher depth than newer ones and so appear "beneath" them new particles, but by setting this function to false you can reverse this order and have the new particles drawn higher and so appear "beneath" the older ones.
zh_cn: 默认系统使用 old > new look(此函数设置为 true)，其中旧粒子的绘制深度比新粒子更高，因此出现在新粒子"下方"，但通过将此函数设置为 false，您可以反转 这个顺序并让新粒子绘制得更高，因此出现在旧粒子的"下方"。

source: The default threshold for all analogue buttons is 0.5, with the range being from 0 to 1.
zh_cn: 所有模拟按钮的默认阈值是0.5，范围从0到1。

source: The default user name
zh_cn: 默认用户名

source: The default value for each of the components is true, and can be supplied as either four unique arguments or as a 4 element 1D array with the following elements in it which will be either true (enabled) or false (disabled):
zh_cn: 每个组件的默认值都是true，可以作为四个唯一的参数提供，也可以作为一个包含以下元素的4元素1D数组提供，这些元素可以是true(启用)或false(禁用):

source: The default value for this is 100, but beware of setting this to any value lower than 1 as that will make any sound played through this emitter inaudible to the listener, however any other value will cause the sound to fade away the further that the emitter is from the listener.
zh_cn: 默认值为100，但注意不要将其设置为任何低于1的值，因为这将使通过该发射器播放的任何声音听不到，然而任何其他值都将导致声音随着发射器远离侦听器而逐渐消失。

source: The default value in the text box.
zh_cn: 文本框中的默认值。

source: The default value is -1 which is no sprite for the cursor, but you can assign any sprite index from the game assets or that has been imported from an external resource.
zh_cn: 默认值是-1，即没有用于光标的精灵，但你可以从游戏资源或从外部资源导入任何精灵索引。

source: The default value is 0° with positive values rotating the camera counter-clockwise, ie: setting the value to 90 will rotate the camera 90° to the left.
zh_cn: 默认值是0°，正值旋转相机逆时针，即:设置值为90将旋转相机90°向左。

source: The default value is 4.
zh_cn: 缺省值为4

source: The default value is false but if set to true this tells GameMaker that the instance will be moving at such high speeds that it will require more expensive collision detection to ensure it doesn't pass through other instances undetected
zh_cn: 默认值为false，但如果设置为true，这将告诉GameMaker实例将以如此高的速度移动，它将需要更昂贵的碰撞检测，以确保它不会在未检测到的情况下通过其他实例

source: The default value is false, and this can also be changed in the Global Game Options for individual target platforms.
zh_cn: 默认值是false，这也可以在单个目标平台的全局游戏选项中更改。

source: The default value is that set by the Global Game Options for your game, or that set using the function gpu_set_texfilter().
zh_cn: 默认值是由你的游戏的全局游戏选项设置的，或者使用函数gpu_set_texfilter()设置的。

source: The default value is that z-testing is disabled, so the function will return false.
zh_cn: 默认值是禁用z-testing，因此函数将返回false。

source: The default value is that z-writing is enabled, so the function will return true.
zh_cn: 默认值是启用z-write，因此函数将返回true。

source: The default value.
zh_cn: 默认值。

source: The default values are as follows:
zh_cn: 默认值如下所示:

source: The defining point to change the attributes of.
zh_cn: 要更改其属性的定义点。

source: The defining point to delete.
zh_cn: 要删除的定义点。

source: The defining point to insert the new point BEFORE.
zh_cn: 要插入新点之前的定义点。

source: The degrees to convert.
zh_cn: 要转换的度数。

source: The delay time for the frame (in 100ths of a second)
zh_cn: 帧的延迟时间(百分之一秒)

source: The delay time is calculated in 1/100ths of a second, but note that once the GIF has been created, if you use it for promotional purposes for example, different browsers may interpret the frame delay slightly differently - see here for more details.
zh_cn: 延迟时间是以1/100秒计算的，但是注意，一旦创建了GIF，例如，如果您将它用于宣传目的，不同的浏览器可能会对帧延迟的解释略有不同——请参见此处了解更多详细信息。

source: The delimiter string to search for.
zh_cn: 要搜索的分隔符字符串。

source: The delimiter to use when joining the values.
zh_cn: 连接值时要使用的分隔符。

source: The density of something is defined as its mass per unit volume, which basically means how much mass is crammed into the space it takes up in the world.
zh_cn: 物体的密度被定义为单位体积的质量，这基本上意味着它在世界上所占的空间中塞进了多少质量。

source: The density of the particle fixture.
zh_cn: 颗粒夹具的密度。

source: The depth at which to set the particle system.
zh_cn: 设定粒子系统的深度。

source: The depth can be any value, where the lower the depth the "nearer" to the camera things will be drawn and the higher the depth the further away, so an instance at depth -200 will be drawn over an instance at depth +300 (for example).
zh_cn: 深度可以是任何值，深度越低，物体就越"接近"相机，深度越高，物体就越"远"，因此深度-200的实例将被绘制在深度+300的实例之上(例如)。

source: The depth that the layer has to be created at.
zh_cn: 创建图层的深度。

source: The depth to assign the created instance to
zh_cn: 要将创建的实例分配到的深度

source: The depth to check and retrieve the layer IDs from.
zh_cn: 检查和检索层id的深度。

source: The description should be a short string of information that describes the save, eg: "Level2, Stage2".
zh_cn: 描述应该是描述保存的简短信息字符串，例如:"Level2, Stage2"。

source: The device (from 0 - n) that is being checked
zh_cn: 被检查的设备(从0到n)

source: The device (from 0 - n) that is being checked.
zh_cn: 被检查的设备(从0到n)。

source: The device argument refers to the device touch number, which can be from 0 to n and note that the maximum number of touches that can be detected will depend very much on the device being used and the OS it runs (most devices will support at least 4 simultaneous touches).
zh_cn: device参数指的是设备触摸数，可以从0到n，注意可以检测到的最大触摸数很大程度上取决于正在使用的设备及其运行的操作系统(大多数设备将支持至少4个同时触摸)。

source: The device argument refers to the touch number, which can be from 0 to n and the maximum number of touches that can be detected will depend very much on the device being used and the OS it runs (most devices will support at least 4 simultaneous touches).
zh_cn: 设备参数指的是触摸次数，可以从0到n，可以检测到的最大触摸次数在很大程度上取决于所使用的设备及其运行的操作系统(大多数设备将支持至少4次同时触摸)。

source: The device is actually an emulator (Windows Phone or Android)
zh_cn: 该设备实际上是一个模拟器(Windows Phone或Android)

source: The device is being held horizontally ie: The longest edge is from left to right, and the menu button is on the right.
zh_cn: 设备水平放置，即:最长的边从左到右，菜单按钮在右边。

source: The device is being held vertically ie: The longest edge is from top to bottom, and the menu button is at the bottom.
zh_cn: 设备是垂直握住的，即:最长的边从上到下，菜单按钮在底部。

source: The difference between this function and network_connect() is that this function can connect to any server and does nothing to the raw data, meaning that you have to implement the protocols yourself at the server end.
zh_cn: 此函数和network_connect()的区别在于，此函数可以连接到任何服务器，对原始数据不做任何操作，这意味着你必须在服务器端自己实现协议。

source: The difference between this function and network_connect_async()is that this function can connect to any server and does nothing to the raw data, meaning that you have to implement the protocols yourself at the server end.
zh_cn: 此函数与network_connect_async()之间的区别在于，此函数可以连接到任何服务器，而对原始数据不做任何操作，这意味着您必须自己在服务器端实现协议。

source: The different arguments that you want to pass through to the external function
zh_cn: 你想传递给外部函数的不同参数

source: The different arguments that you want to pass through to the function/script
zh_cn: 您想传递给函数/脚本的不同参数

source: The different bounding box values are always relative to the top left corner of the sprite (irrespective of the x and y origin) which is considered position (0, 0).
zh_cn: 不同的边界框值总是相对于sprite的左上角(不考虑x和y原点),它被认为是位置(0，0)。

source: The different types of arguments being used
zh_cn: 使用的不同类型的参数

source: The direction of the gravity.
zh_cn: 重力的方向。

source: The direction of the point to return.
zh_cn: 返回点的方向。

source: The direction to move in.
zh_cn: 移动的方向。

source: The directory to start the search from.
zh_cn: 开始搜索的目录。

source: The display name can be set in the Game Options.
zh_cn: 显示名称可以在游戏选项中设置。

source: The distance (in inches) to set for double tap gesture event detection.
zh_cn: 为双击手势事件检测设置的距离(英寸)。

source: The distance (in inches) to set for drag gesture event detection.
zh_cn: 为拖动手势事件检测设置的距离(以英寸为单位)。

source: The distance in pixels between lines of text as if the string was being drawn.
zh_cn: 在绘制字符串时文本行之间的像素距离。

source: The distance in pixels between lines of text.
zh_cn: 文本行之间的像素距离。

source: The distance is measured in inches and has a default value of 0.1.
zh_cn: 该距离以英寸为单位测量，默认值为0.1。

source: The distance to end the fog
zh_cn: 结束雾的距离

source: The distance to start applying fog from
zh_cn: 开始应用雾的距离

source: The distribution style of the particles.
zh_cn: 粒子的分布方式。

source: The dot product is a value expressing the angular relationship between two vectors and is found by taking two vectors, multiplying them together and then adding the results.
zh_cn: 点积是一个表示两个向量之间角度关系的值，通过取两个向量，将它们相乘，然后将结果相加得到。

source: The draw alpha affects the transparency of all draw functions, and can be set with the draw_set_alpha() function.
zh_cn: 绘制alpha影响所有绘制函数的透明度，可以用draw_set_alpha()函数设置。

source: The draw begin event.
zh_cn: 绘制开始事件

source: The draw end event.
zh_cn: 绘制结束事件

source: The draw gui begin event.
zh_cn: 绘制GUI开始事件

source: The draw gui end event.
zh_cn: 绘制GUI结束事件

source: The draw gui event.
zh_cn: 绘制GUI事件

source: The duration of the interpolation (from 0 to 1)
zh_cn: 插值的持续时间(从0到1)

source: The element is a background.
zh_cn: 该元素是一个背景。

source: The element is a legacy background tile (this is only valid for projects that have been imported from previous versions of GameMaker).
zh_cn: 该元素是一个传统背景图块(仅对从GameMaker的早期版本导入的项目有效)。

source: The element is a particle system.
zh_cn: 元素是一个粒子系统。

source: The element is a sequence asset.
zh_cn: 该元素是序列资源。

source: The element is a sprite asset.
zh_cn: 该元素是一个精灵资源。

source: The element is a tilemap.
zh_cn: 该元素是一个tilemap。

source: The element is an instance.
zh_cn: 该元素是一个实例。

source: The emitter to link to the audio bus.
zh_cn: 发射器连接到音频总线。

source: The emitter whose audio bus should be returned.
zh_cn: 应该返回其音频总线的发射器。

source: The end alpha of the particle.
zh_cn: 粒子的末尾。

source: The end of the buffer
zh_cn: 缓冲区的结束

source: The end result is two independent lists which contain the same information.
zh_cn: 最终结果是包含相同信息的两个独立列表。

source: The ending alpha of the particle.
zh_cn: 粒子的末尾alpha。

source: The error can be caused by invalid token, mismatch in client versions, mismatch in protocol versions.
zh_cn: 错误可能是由无效的令牌、客户端版本不匹配、协议版本不匹配引起的。

source: The error means that client uses obsolete version of the protocol.
zh_cn: 该错误意味着客户端使用的是该协议的过时版本。

source: The exact contents of the map are shown below:
zh_cn: map的具体内容如下:

source: The exact information returned will depend on the OS and the device, so it is recommended that you test this function on all platforms that you wish to target and output the returned values using a function like show_debug_message().
zh_cn: 返回的确切信息将取决于操作系统和设备，因此建议您在希望瞄准的所有平台上测试此函数，并使用show_debug_message()之类的函数输出返回值。

source: The exact string format will vary depending on the target platform chosen, but it will mostly have the script/event name, then a colon : and the line number, similar to this:
zh_cn: 确切的字符串格式将根据所选的目标平台而有所不同，但它通常包含脚本/事件名称，然后是冒号:和行号，如下所示:

source: The example code below shows a typical use of this command in the draw event of an instance to check for a surface and re-create it if it has been removed (note that the surface will have been originally created in the create event of the object).
zh_cn: 下面的示例代码显示了该命令在实例的draw事件中的典型用法，用于检查表面并在表面已被删除时重新创建它(注意，表面最初是在对象的create事件中创建的)。

source: The example image below shows the default position for the listener in the audio space:
zh_cn: 下面的示例图像显示了在音频空间中的默认位置:

source: The expiry type of the time source
zh_cn: 时间源的到期类型

source: The falloff factor (default 1).
zh_cn: 衰减乘数(默认为1)。

source: The falloff reference relative to the listener (clamp).
zh_cn: 相对于(钳制)的衰减参考。

source: The far clipping plane.
zh_cn: 远剪裁平面。

source: The file (OGG only) to stream the audio from.
zh_cn: 用于流播放音频的文件(仅OGG)。

source: The file find functions open handles into the file directory and these take up a minimal amount of memory, which (over time) mounts up.
zh_cn: 文件查找功能打开文件目录中的句柄，这些句柄只占用最小的内存量，随着时间的推移，内存会逐渐增加。

source: The file itself can have almost any extension (for example, *.dat, *.json, *.bin, etc...) and will be obfuscated and stored to local storage on the target platform.
zh_cn: 文件本身几乎可以有任何扩展名(例如，*.dat, *.json, *.bin等)，并将被模糊化并存储到目标平台的本地存储中。

source: The file name and path to use.
zh_cn: 要使用的文件名和路径。

source: The file should contain all the information that you need to save for your game as you can only store one single "data blob" to the cloud, and running this function again will overwrite any previously stored values (as will using the cloud_string_save() function).
zh_cn: 该文件应该包含你需要为游戏保存的所有信息，因为你只能将一个"数据包"存储到云端，再次运行此函数将覆盖所有之前存储的值(如使用cloud_string_save()函数))。

source: The file to be uploaded (as a string).
zh_cn: 要上传的文件(作为字符串)。

source: The file to generate the MD5 hash for.
zh_cn: 要为其生成MD5哈希的文件。

source: The file to generate the sha1 hash for.
zh_cn: 要为其生成sha1哈希的文件。

source: The file to stream the audio from.
zh_cn: 音频流所来自的文件。

source: The file to use.
zh_cn: 要使用的文件。

source: The file type filter and/or name.
zh_cn: 文件类型过滤器和/或名称。

source: The file will be saved to the working directory of the game, which in windows is located at <drive>:/Users/YOURUSERNAME/AppData/Local/[Game Name]/ and on Mac it would be ~/Library/Application Support/[Game Name]/.
zh_cn: 该文件将保存到游戏的工作目录中，在windows中位于:/Users/YOURUSERNAME/AppData/Local/[游戏名]/，在Mac中它将是~/Library/Application Support/[游戏名]/。

source: The filename for the .ini file.
zh_cn: .ini文件的文件名

source: The filename for the saved sprite strip.
zh_cn: 保存的精灵条的文件名。

source: The filename for the saved sprite.
zh_cn: 保存的精灵的文件名。

source: The filename for the screenshot to save
zh_cn: 要保存的截图的文件名

source: The filename of the image to make the new sprite.
zh_cn: 制作新精灵的图像的文件名。

source: The filename to use for the gif
zh_cn: 用于gif的文件名

source: The filter has the form "name1|mask1|name2|mask2|...", where the mask may contain the different options with a semicolon between them and you can also use a "*" to mean any string.
zh_cn: 该过滤器的形式为"名称1|掩码1|名称2|掩码2| ..."，其中掩码可能包含不同的选项，选项之间用分号隔开，您也可以使用"*"表示任何字符串。

source: The filtered elements will be padded to offset and order by the traversing direction.
zh_cn: 过滤后的元素将按偏移和遍历方向排序填充。

source: The final argument is for making the sound loop and setting it to true will make the sound loop until it is stopped and setting it to false will play the sound once only.
zh_cn: 最后一个参数是使声音循环，设置为true将使声音循环直到停止，设置为false将只播放一次声音。

source: The final look of the primitive will depend on the primitive type chosen to draw (See draw_primitive_begin() for more information), the order with which you add the vertexes to it and the position of the start point you set for the texture.
zh_cn: 图元的最终外观取决于所选择绘制的图元类型(更多信息请参见draw_primitive_begin())、添加顶点的顺序以及为纹理设置的起始点的位置。
